I've tested this with the following results:

<details><summary>Terraform Specification</summary>
<p>

`main.tf`:

```hcl
provider "vsphere" {
  vsphere_server       = var.vsphere_server
  user                 = var.vsphere_username
  password             = var.vsphere_password
  allow_unverified_ssl = var.vsphere_insecure
}

data "vsphere_datacenter" "datacenter" {
  name = var.vsphere_datacenter
}

data "vsphere_network" "network" {
  name          = var.vsphere_network
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_compute_cluster" "cluster" {
  name          = var.vsphere_cluster
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_resource_pool" "pool" {
  name          = format("%s%s", data.vsphere_compute_cluster.cluster.name, "/Resources")
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_datastore_cluster" "datastore_cluster" {
  name          = var.vsphere_datastore_cluster
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_virtual_machine" "template" {
  name          = var.vsphere_template
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

resource "vsphere_virtual_machine" "vm" {
  name                    = var.vm_name
  folder                  = var.vsphere_folder
  num_cpus                = var.vm_cpus
  memory                  = var.vm_memory
  firmware                = var.vm_firmware
  efi_secure_boot_enabled = var.vm_efi_secure_boot_enabled
  guest_id                = data.vsphere_virtual_machine.template.guest_id
  datastore_cluster_id    = data.vsphere_datastore_cluster.datastore_cluster.id
  resource_pool_id        = data.vsphere_resource_pool.pool.id
  network_interface {
    network_id = data.vsphere_network.network.id
  }
  disk {
    label            = "disk0"
    size             = data.vsphere_virtual_machine.template.disks.0.size
  }
  disk {
    unit_number      = 1
    label            = "disk1"
    size             = 16
  }
  disk {
    unit_number      = 2
    label            = "disk2"
    size             = 24
  }
  disk {
    unit_number      = 3
    label            = "disk3"
    size             = 32
  }
  disk {
    unit_number      = 4
    label            = "disk4"
    size             = 48
  }
  disk {
    unit_number      = 5
    label            = "disk5"
    size             = 64
  }
  clone {
    template_uuid = data.vsphere_virtual_machine.template.id
  }
  lifecycle {
    ignore_changes = [
      clone[0].template_uuid,
    ]
  }
}

```

</p>
</details> 

<details><summary>PASS: DSC VM Affinity = False</summary>
<p>

Deploys to `nfs-1/datastore-8009` for "scsi:0:0" and "nfs-3/datastore-8011` for "scsi:0:1 - "scsi:0:5". Seen in the `.state` as follows:

```shell
    disk {
        ...
        controller_type   = "scsi"
        datastore_id      = "datastore-8009"
        device_address    = "scsi:0:0"
        ...
    }
    disk {
        ...
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:1"
        ...
    }
    disk {
        ...
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:2"
        ...
    }
    disk {
        ...
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:3"
        ...
    disk {
        ...
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:4"
        ...
    }
    disk {
        ...
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:5"
        ...
    }
```

```shell
PS F:\Code\test> terraform init
Initializing the backend...
Initializing provider plugins...
- Finding hashicorp/vsphere versions matching "2.8.1"...
- Installing hashicorp/vsphere v2.8.1...
- Installed hashicorp/vsphere v2.8.1 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - vmware/vcf in C:\Users\Administrator\go\bin
│
│ Skip terraform init when using provider development overrides. It is not necessary and may error unexpectedly.
╵
Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
PS F:\Code\test> terraform plan
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - vmware/vcf in C:\Users\Administrator\go\bin
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵
data.vsphere_datacenter.datacenter: Reading...
data.vsphere_datacenter.datacenter: Read complete after 0s [id=datacenter-3]
data.vsphere_datastore_cluster.datastore_cluster: Reading...
data.vsphere_virtual_machine.template: Reading...
data.vsphere_network.network: Reading...
data.vsphere_compute_cluster.cluster: Reading...
data.vsphere_network.network: Read complete after 0s [id=dvportgroup-8014]
data.vsphere_datastore_cluster.datastore_cluster: Read complete after 0s [id=group-p8013]
data.vsphere_compute_cluster.cluster: Read complete after 0s [id=domain-c9]
data.vsphere_resource_pool.pool: Reading...
data.vsphere_virtual_machine.template: Read complete after 1s [id=421f22cb-046b-7ff7-9fd8-b0a266595003]
data.vsphere_resource_pool.pool: Read complete after 1s [id=resgroup-10]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vsphere_virtual_machine.vm will be created
  + resource "vsphere_virtual_machine" "vm" {
      + annotation                              = (known after apply)
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_cluster_id                    = "group-p8013"
      + datastore_id                            = (known after apply)
      + default_ip_address                      = (known after apply)
      + efi_secure_boot_enabled                 = true
      + ept_rvi_mode                            = "automatic"
      + extra_config_reboot_required            = true
      + firmware                                = "efi"
      + folder                                  = "workloads"
      + force_power_off                         = true
      + guest_id                                = "vmwarePhoton64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 1024
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "photon-test"
      + num_cores_per_socket                    = 1
      + num_cpus                                = 1
      + power_state                             = (known after apply)
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-10"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + sync_time_with_host                     = true
      + tools_upgrade_policy                    = "manual"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5

      + clone {
          + template_uuid = "421f22cb-046b-7ff7-9fd8-b0a266595003"
          + timeout       = 30
        }

      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk0"
          + path              = (known after apply)
          + size              = 16
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk1"
          + path              = (known after apply)
          + size              = 16
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 1
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk2"
          + path              = (known after apply)
          + size              = 24
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 2
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk3"
          + path              = (known after apply)
          + size              = 32
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 3
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk4"
          + path              = (known after apply)
          + size              = 48
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 4
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk5"
          + path              = (known after apply)
          + size              = 64
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 5
          + uuid              = (known after apply)
          + write_through     = false
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "dvportgroup-8014"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
PS F:\Code\test> terraform apply --auto-approve
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - vmware/vcf in C:\Users\Administrator\go\bin
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵
data.vsphere_datacenter.datacenter: Reading...
data.vsphere_datacenter.datacenter: Read complete after 0s [id=datacenter-3]
data.vsphere_datastore_cluster.datastore_cluster: Reading...
data.vsphere_virtual_machine.template: Reading...
data.vsphere_network.network: Reading...
data.vsphere_compute_cluster.cluster: Reading...
data.vsphere_network.network: Read complete after 0s [id=dvportgroup-8014]
data.vsphere_datastore_cluster.datastore_cluster: Read complete after 0s [id=group-p8013]
data.vsphere_compute_cluster.cluster: Read complete after 0s [id=domain-c9]
data.vsphere_resource_pool.pool: Reading...
data.vsphere_virtual_machine.template: Read complete after 0s [id=421f22cb-046b-7ff7-9fd8-b0a266595003]
data.vsphere_resource_pool.pool: Read complete after 0s [id=resgroup-10]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vsphere_virtual_machine.vm will be created
  + resource "vsphere_virtual_machine" "vm" {
      + annotation                              = (known after apply)
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_cluster_id                    = "group-p8013"
      + datastore_id                            = (known after apply)
      + default_ip_address                      = (known after apply)
      + efi_secure_boot_enabled                 = true
      + ept_rvi_mode                            = "automatic"
      + extra_config_reboot_required            = true
      + firmware                                = "efi"
      + folder                                  = "workloads"
      + force_power_off                         = true
      + guest_id                                = "vmwarePhoton64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 1024
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "photon-test"
      + num_cores_per_socket                    = 1
      + num_cpus                                = 1
      + power_state                             = (known after apply)
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-10"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + sync_time_with_host                     = true
      + tools_upgrade_policy                    = "manual"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5

      + clone {
          + template_uuid = "421f22cb-046b-7ff7-9fd8-b0a266595003"
          + timeout       = 30
        }

      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk0"
          + path              = (known after apply)
          + size              = 16
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk1"
          + path              = (known after apply)
          + size              = 16
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 1
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk2"
          + path              = (known after apply)
          + size              = 24
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 2
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk3"
          + path              = (known after apply)
          + size              = 32
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 3
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk4"
          + path              = (known after apply)
          + size              = 48
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 4
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk5"
          + path              = (known after apply)
          + size              = 64
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 5
          + uuid              = (known after apply)
          + write_through     = false
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "dvportgroup-8014"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
vsphere_virtual_machine.vm: Creating...
vsphere_virtual_machine.vm: Still creating... [10s elapsed]
vsphere_virtual_machine.vm: Still creating... [20s elapsed]
vsphere_virtual_machine.vm: Still creating... [30s elapsed]
vsphere_virtual_machine.vm: Still creating... [40s elapsed]
vsphere_virtual_machine.vm: Still creating... [50s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m0s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m10s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m20s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m30s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m40s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m50s elapsed]
vsphere_virtual_machine.vm: Creation complete after 1m59s [id=421f7bfa-d1fc-de27-5839-3dde29b3424f]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

PS F:\Code\test>
PS F:\Code\test> terraform state show vsphere_virtual_machine.vm
# vsphere_virtual_machine.vm:
resource "vsphere_virtual_machine" "vm" {
    alternate_guest_name                    = null
    annotation                              = null
    boot_delay                              = 0
    boot_retry_delay                        = 10000
    boot_retry_enabled                      = false
    change_version                          = "2025-04-30T18:41:09.218875Z"
    cpu_hot_add_enabled                     = false
    cpu_hot_remove_enabled                  = false
    cpu_limit                               = -1
    cpu_performance_counters_enabled        = false
    cpu_reservation                         = 0
    cpu_share_count                         = 1000
    cpu_share_level                         = "normal"
    datastore_cluster_id                    = "group-p8013"
    datastore_id                            = "datastore-8011"
    default_ip_address                      = "10.13.14.51"
    efi_secure_boot_enabled                 = true
    enable_disk_uuid                        = false
    enable_logging                          = false
    ept_rvi_mode                            = null
    extra_config_reboot_required            = true
    firmware                                = "efi"
    folder                                  = "workloads"
    force_power_off                         = true
    guest_id                                = "vmwarePhoton64Guest"
    guest_ip_addresses                      = [
        "10.13.14.51",
        "fe80::250:56ff:fe9f:da76",
    ]
    hardware_version                        = 21
    host_system_id                          = "host-17"
    hv_mode                                 = null
    id                                      = "421f7bfa-d1fc-de27-5839-3dde29b3424f"
    ide_controller_count                    = 2
    latency_sensitivity                     = "normal"
    memory                                  = 1024
    memory_hot_add_enabled                  = false
    memory_limit                            = -1
    memory_reservation                      = 0
    memory_reservation_locked_to_max        = false
    memory_share_count                      = 10240
    memory_share_level                      = "normal"
    migrate_wait_timeout                    = 30
    moid                                    = "vm-8021"
    name                                    = "photon-test"
    nested_hv_enabled                       = false
    num_cores_per_socket                    = 1
    num_cpus                                = 1
    power_state                             = "on"
    poweron_timeout                         = 300
    reboot_required                         = false
    resource_pool_id                        = "resgroup-10"
    run_tools_scripts_after_power_on        = true
    run_tools_scripts_after_resume          = true
    run_tools_scripts_before_guest_reboot   = false
    run_tools_scripts_before_guest_shutdown = true
    run_tools_scripts_before_guest_standby  = true
    sata_controller_count                   = 0
    scsi_bus_sharing                        = "noSharing"
    scsi_controller_count                   = 1
    scsi_type                               = "pvscsi"
    shutdown_wait_timeout                   = 3
    storage_policy_id                       = null
    swap_placement_policy                   = "inherit"
    sync_time_with_host                     = true
    sync_time_with_host_periodically        = false
    tools_upgrade_policy                    = "manual"
    uuid                                    = "421f7bfa-d1fc-de27-5839-3dde29b3424f"
    vapp_transport                          = []
    vbs_enabled                             = false
    vmware_tools_status                     = "guestToolsRunning"
    vmx_path                                = "photon-test/photon-test.vmx"
    vvtd_enabled                            = false
    wait_for_guest_ip_timeout               = 0
    wait_for_guest_net_routable             = true
    wait_for_guest_net_timeout              = 5

    clone {
        linked_clone  = false
        template_uuid = "421f22cb-046b-7ff7-9fd8-b0a266595003"
        timeout       = 30
    }

    disk {
        attach            = false
        controller_type   = "scsi"
        datastore_id      = "datastore-8009"
        device_address    = "scsi:0:0"
        disk_mode         = "persistent"
        disk_sharing      = "sharingNone"
        eagerly_scrub     = false
        io_limit          = -1
        io_reservation    = 0
        io_share_count    = 1000
        io_share_level    = "normal"
        keep_on_remove    = false
        key               = 2000
        label             = "disk0"
        path              = "photon-test/photon-test.vmdk"
        size              = 16
        storage_policy_id = null
        thin_provisioned  = true
        unit_number       = 0
        uuid              = "6000C29b-a334-0ae5-d6a4-1c32a053d700"
        write_through     = false
    }
    disk {
        attach            = false
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:1"
        disk_mode         = "persistent"
        disk_sharing      = "sharingNone"
        eagerly_scrub     = false
        io_limit          = -1
        io_reservation    = 0
        io_share_count    = 1000
        io_share_level    = "normal"
        keep_on_remove    = false
        key               = 2001
        label             = "disk1"
        path              = "photon-test/photon-test_1.vmdk"
        size              = 16
        storage_policy_id = null
        thin_provisioned  = true
        unit_number       = 1
        uuid              = "6000C29e-09ca-4929-e780-bd3a165d3ab5"
        write_through     = false
    }
    disk {
        attach            = false
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:2"
        disk_mode         = "persistent"
        disk_sharing      = "sharingNone"
        eagerly_scrub     = false
        io_limit          = -1
        io_reservation    = 0
        io_share_count    = 1000
        io_share_level    = "normal"
        keep_on_remove    = false
        key               = 2002
        label             = "disk2"
        path              = "photon-test/photon-test_2.vmdk"
        size              = 24
        storage_policy_id = null
        thin_provisioned  = true
        unit_number       = 2
        uuid              = "6000C297-9b70-533f-53c4-ae762772874a"
        write_through     = false
    }
    disk {
        attach            = false
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:3"
        disk_mode         = "persistent"
        disk_sharing      = "sharingNone"
        eagerly_scrub     = false
        io_limit          = -1
        io_reservation    = 0
        io_share_count    = 1000
        io_share_level    = "normal"
        keep_on_remove    = false
        key               = 2003
        label             = "disk3"
        path              = "photon-test/photon-test_3.vmdk"
        size              = 32
        storage_policy_id = null
        thin_provisioned  = true
        unit_number       = 3
        uuid              = "6000C29a-57d2-3110-2437-2c5af5240585"
        write_through     = false
    }
    disk {
        attach            = false
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:4"
        disk_mode         = "persistent"
        disk_sharing      = "sharingNone"
        eagerly_scrub     = false
        io_limit          = -1
        io_reservation    = 0
        io_share_count    = 1000
        io_share_level    = "normal"
        keep_on_remove    = false
        key               = 2004
        label             = "disk4"
        path              = "photon-test/photon-test_4.vmdk"
        size              = 48
        storage_policy_id = null
        thin_provisioned  = true
        unit_number       = 4
        uuid              = "6000C296-dceb-2c66-b7f5-6c667e01ddab"
        write_through     = false
    }
    disk {
        attach            = false
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:5"
        disk_mode         = "persistent"
        disk_sharing      = "sharingNone"
        eagerly_scrub     = false
        io_limit          = -1
        io_reservation    = 0
        io_share_count    = 1000
        io_share_level    = "normal"
        keep_on_remove    = false
        key               = 2005
        label             = "disk5"
        path              = "photon-test/photon-test_5.vmdk"
        size              = 64
        storage_policy_id = null
        thin_provisioned  = true
        unit_number       = 5
        uuid              = "6000C290-ac7f-bd3d-1e67-de0016c7aee4"
        write_through     = false
    }

    network_interface {
        adapter_type          = "vmxnet3"
        bandwidth_limit       = -1
        bandwidth_reservation = 0
        bandwidth_share_count = 50
        bandwidth_share_level = "normal"
        device_address        = "pci:0:7"
        key                   = 4000
        mac_address           = "00:50:56:9f:da:76"
        network_id            = "dvportgroup-8014"
        ovf_mapping           = null
        physical_function     = null
        use_static_mac        = false
    }
}
```

</p>
</details> 


<details><summary>PASS: DSC VM Affinity = True</summary>
<p>

Deploys to `nfs-3 / datastore-8011` for "scsi:0:0 - "scsi:0:5".. Seen in the `.state` as follows:

```shell
    disk {
        ...
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:0"
        ...
    }
    disk {
        ...
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:1"
        ...
    }
    disk {
        ...
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:2"
        ...
    }
    disk {
        ...
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:3"
        ...
    disk {
        ...
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:4"
        ...
    }
    disk {
        ...
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:5"
        ...
    }
```


```shell
PS F:\Code\test> terraform apply --auto-approve
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - vmware/vcf in C:\Users\Administrator\go\bin
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵
data.vsphere_datacenter.datacenter: Reading...
data.vsphere_datacenter.datacenter: Read complete after 0s [id=datacenter-3]
data.vsphere_datastore_cluster.datastore_cluster: Reading...
data.vsphere_virtual_machine.template: Reading...
data.vsphere_network.network: Reading...
data.vsphere_compute_cluster.cluster: Reading...
data.vsphere_network.network: Read complete after 0s [id=dvportgroup-8014]
data.vsphere_datastore_cluster.datastore_cluster: Read complete after 0s [id=group-p8013]
data.vsphere_compute_cluster.cluster: Read complete after 0s [id=domain-c9]
data.vsphere_resource_pool.pool: Reading...
data.vsphere_virtual_machine.template: Read complete after 0s [id=421f22cb-046b-7ff7-9fd8-b0a266595003]
data.vsphere_resource_pool.pool: Read complete after 0s [id=resgroup-10]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vsphere_virtual_machine.vm will be created
  + resource "vsphere_virtual_machine" "vm" {
      + annotation                              = (known after apply)
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_cluster_id                    = "group-p8013"
      + datastore_id                            = (known after apply)
      + default_ip_address                      = (known after apply)
      + efi_secure_boot_enabled                 = true
      + ept_rvi_mode                            = "automatic"
      + extra_config_reboot_required            = true
      + firmware                                = "efi"
      + folder                                  = "workloads"
      + force_power_off                         = true
      + guest_id                                = "vmwarePhoton64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 1024
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "photon-test"
      + num_cores_per_socket                    = 1
      + num_cpus                                = 1
      + power_state                             = (known after apply)
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-10"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + sync_time_with_host                     = true
      + tools_upgrade_policy                    = "manual"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5

      + clone {
          + template_uuid = "421f22cb-046b-7ff7-9fd8-b0a266595003"
          + timeout       = 30
        }

      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk0"
          + path              = (known after apply)
          + size              = 16
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk1"
          + path              = (known after apply)
          + size              = 16
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 1
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk2"
          + path              = (known after apply)
          + size              = 24
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 2
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk3"
          + path              = (known after apply)
          + size              = 32
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 3
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk4"
          + path              = (known after apply)
          + size              = 48
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 4
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk5"
          + path              = (known after apply)
          + size              = 64
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 5
          + uuid              = (known after apply)
          + write_through     = false
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "dvportgroup-8014"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
vsphere_virtual_machine.vm: Creating...
vsphere_virtual_machine.vm: Still creating... [10s elapsed]
vsphere_virtual_machine.vm: Still creating... [20s elapsed]
vsphere_virtual_machine.vm: Still creating... [30s elapsed]
vsphere_virtual_machine.vm: Still creating... [40s elapsed]
vsphere_virtual_machine.vm: Still creating... [50s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m0s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m10s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m20s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m30s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m40s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m50s elapsed]
vsphere_virtual_machine.vm: Still creating... [2m0s elapsed]
vsphere_virtual_machine.vm: Creation complete after 2m4s [id=421faa9f-cec4-59c9-e634-ba0c90aa0920]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
PS F:\Code\test> terraform state show vsphere_virtual_machine.vm
# vsphere_virtual_machine.vm:
resource "vsphere_virtual_machine" "vm" {
    alternate_guest_name                    = null
    annotation                              = null
    boot_delay                              = 0
    boot_retry_delay                        = 10000
    boot_retry_enabled                      = false
    change_version                          = "2025-04-30T18:54:13.205601Z"
    cpu_hot_add_enabled                     = false
    cpu_hot_remove_enabled                  = false
    cpu_limit                               = -1
    cpu_performance_counters_enabled        = false
    cpu_reservation                         = 0
    cpu_share_count                         = 1000
    cpu_share_level                         = "normal"
    datastore_cluster_id                    = "group-p8013"
    datastore_id                            = "datastore-8011"
    default_ip_address                      = "10.13.14.51"
    efi_secure_boot_enabled                 = true
    enable_disk_uuid                        = false
    enable_logging                          = false
    ept_rvi_mode                            = null
    extra_config_reboot_required            = true
    firmware                                = "efi"
    folder                                  = "workloads"
    force_power_off                         = true
    guest_id                                = "vmwarePhoton64Guest"
    guest_ip_addresses                      = [
        "10.13.14.51",
        "fe80::250:56ff:fe9f:f70e",
    ]
    hardware_version                        = 21
    host_system_id                          = "host-17"
    hv_mode                                 = null
    id                                      = "421faa9f-cec4-59c9-e634-ba0c90aa0920"
    ide_controller_count                    = 2
    latency_sensitivity                     = "normal"
    memory                                  = 1024
    memory_hot_add_enabled                  = false
    memory_limit                            = -1
    memory_reservation                      = 0
    memory_reservation_locked_to_max        = false
    memory_share_count                      = 10240
    memory_share_level                      = "normal"
    migrate_wait_timeout                    = 30
    moid                                    = "vm-8022"
    name                                    = "photon-test"
    nested_hv_enabled                       = false
    num_cores_per_socket                    = 1
    num_cpus                                = 1
    power_state                             = "on"
    poweron_timeout                         = 300
    reboot_required                         = false
    resource_pool_id                        = "resgroup-10"
    run_tools_scripts_after_power_on        = true
    run_tools_scripts_after_resume          = true
    run_tools_scripts_before_guest_reboot   = false
    run_tools_scripts_before_guest_shutdown = true
    run_tools_scripts_before_guest_standby  = true
    sata_controller_count                   = 0
    scsi_bus_sharing                        = "noSharing"
    scsi_controller_count                   = 1
    scsi_type                               = "pvscsi"
    shutdown_wait_timeout                   = 3
    storage_policy_id                       = null
    swap_placement_policy                   = "inherit"
    sync_time_with_host                     = true
    sync_time_with_host_periodically        = false
    tools_upgrade_policy                    = "manual"
    uuid                                    = "421faa9f-cec4-59c9-e634-ba0c90aa0920"
    vapp_transport                          = []
    vbs_enabled                             = false
    vmware_tools_status                     = "guestToolsRunning"
    vmx_path                                = "photon-test/photon-test.vmx"
    vvtd_enabled                            = false
    wait_for_guest_ip_timeout               = 0
    wait_for_guest_net_routable             = true
    wait_for_guest_net_timeout              = 5

    clone {
        linked_clone  = false
        template_uuid = "421f22cb-046b-7ff7-9fd8-b0a266595003"
        timeout       = 30
    }

    disk {
        attach            = false
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:0"
        disk_mode         = "persistent"
        disk_sharing      = "sharingNone"
        eagerly_scrub     = false
        io_limit          = -1
        io_reservation    = 0
        io_share_count    = 1000
        io_share_level    = "normal"
        keep_on_remove    = false
        key               = 2000
        label             = "disk0"
        path              = "photon-test/photon-test.vmdk"
        size              = 16
        storage_policy_id = null
        thin_provisioned  = true
        unit_number       = 0
        uuid              = "6000C299-62e5-0179-7401-27d5041e7717"
        write_through     = false
    }
    disk {
        attach            = false
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:1"
        disk_mode         = "persistent"
        disk_sharing      = "sharingNone"
        eagerly_scrub     = false
        io_limit          = -1
        io_reservation    = 0
        io_share_count    = 1000
        io_share_level    = "normal"
        keep_on_remove    = false
        key               = 2001
        label             = "disk1"
        path              = "photon-test/photon-test_1.vmdk"
        size              = 16
        storage_policy_id = null
        thin_provisioned  = true
        unit_number       = 1
        uuid              = "6000C293-d2fc-5272-6f21-20d07a2dd259"
        write_through     = false
    }
    disk {
        attach            = false
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:2"
        disk_mode         = "persistent"
        disk_sharing      = "sharingNone"
        eagerly_scrub     = false
        io_limit          = -1
        io_reservation    = 0
        io_share_count    = 1000
        io_share_level    = "normal"
        keep_on_remove    = false
        key               = 2002
        label             = "disk2"
        path              = "photon-test/photon-test_2.vmdk"
        size              = 24
        storage_policy_id = null
        thin_provisioned  = true
        unit_number       = 2
        uuid              = "6000C293-80f9-0b2b-f9fa-e40e2652574a"
        write_through     = false
    }
    disk {
        attach            = false
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:3"
        disk_mode         = "persistent"
        disk_sharing      = "sharingNone"
        eagerly_scrub     = false
        io_limit          = -1
        io_reservation    = 0
        io_share_count    = 1000
        io_share_level    = "normal"
        keep_on_remove    = false
        key               = 2003
        label             = "disk3"
        path              = "photon-test/photon-test_3.vmdk"
        size              = 32
        storage_policy_id = null
        thin_provisioned  = true
        unit_number       = 3
        uuid              = "6000C29d-3bf0-f07f-26ab-91dc4aa2e213"
        write_through     = false
    }
    disk {
        attach            = false
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:4"
        disk_mode         = "persistent"
        disk_sharing      = "sharingNone"
        eagerly_scrub     = false
        io_limit          = -1
        io_reservation    = 0
        io_share_count    = 1000
        io_share_level    = "normal"
        keep_on_remove    = false
        key               = 2004
        label             = "disk4"
        path              = "photon-test/photon-test_4.vmdk"
        size              = 48
        storage_policy_id = null
        thin_provisioned  = true
        unit_number       = 4
        uuid              = "6000C292-611c-529d-9652-e9fd4256d815"
        write_through     = false
    }
    disk {
        attach            = false
        controller_type   = "scsi"
        datastore_id      = "datastore-8011"
        device_address    = "scsi:0:5"
        disk_mode         = "persistent"
        disk_sharing      = "sharingNone"
        eagerly_scrub     = false
        io_limit          = -1
        io_reservation    = 0
        io_share_count    = 1000
        io_share_level    = "normal"
        keep_on_remove    = false
        key               = 2005
        label             = "disk5"
        path              = "photon-test/photon-test_5.vmdk"
        size              = 64
        storage_policy_id = null
        thin_provisioned  = true
        unit_number       = 5
        uuid              = "6000C297-5fac-b153-c1ea-7a1feba96311"
        write_through     = false
    }

    network_interface {
        adapter_type          = "vmxnet3"
        bandwidth_limit       = -1
        bandwidth_reservation = 0
        bandwidth_share_count = 50
        bandwidth_share_level = "normal"
        device_address        = "pci:0:7"
        key                   = 4000
        mac_address           = "00:50:56:9f:f7:0e"
        network_id            = "dvportgroup-8014"
        ovf_mapping           = null
        physical_function     = null
        use_static_mac        = false
    }
}
PS F:\Code\test>
```

</p>
</details> 

However, even though these both pass (especially the one with VM Affinity set to `false`) the results with VM Affinity set to `false` differ from the results that would be seen with performing the same task using the vSphere UI. In the case of using the Terraform resource, two datastores in the cluster are used (one for the first disk and another for all additional); however, when performing this using vSphere UI the disk are placed across five datastores in this reproduction.

This is consistently repeatable and does lead me to suspect that there is an error in the logic where the recommendations are applied for the first two, but none after.

We'll proceed with reviewing this over the coming days.